#2. Найдите корни квадратного уравнения Ax² + Bx + C = 0
#Ввод: A, B, C
#		D = B^2 - 4*A*C
#		x = -D/(2*A)
#  		
#		x1 = (-b + sqrt(D)) / 2 * a
#		x2 = (-b - sqrt(D)) / 2 * a

a = int(input("Введите значение А"))
b = int(input("Введите значение B"))
c = int(input("Введите значение C"))
d = b**2 - 4*a*c
x_result = -d/(2*a)
x_1 = (-b + d*0.5) / 2 * a
x_2 = (-b - d*0.5) / 2 * a
print(x_1, x_2)


